In [3]:
import pandas as pd

In [4]:
data = [[3, 'Mila', 9, 60301], [12, 'Antonella', None, 31000], [13, 'Emery', None, 67084], [1, 'Kalel', 11, 21241], [9, 'Mikaela', None, 50937], [11, 'Joziah', 6, 28485]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'manager_id', 'salary']).astype({'employee_id':'Int64', 'name':'object', 'manager_id':'Int64', 'salary':'Int64'})

In [5]:
employees

   employee_id       name  manager_id  salary
0            3       Mila           9   60301
1           12  Antonella        <NA>   31000
2           13      Emery        <NA>   67084
3            1      Kalel          11   21241
4            9    Mikaela        <NA>   50937
5           11     Joziah           6   28485

Find the IDs of the employees whose salary is strictly less than $30000 and whose manager left the company. When a manager leaves the company, their information is deleted from the Employees table, but the reports still have their manager_id set to the manager that left.

Return the result table ordered by employee_id.

The result format is in the following example.

| employee_id |
|-------------|
| 11          |

In [15]:
employees.loc[
        (employees.salary < 30000) & 
        (~employees.manager_id.isin(employees["employee_id"])) & 
        (~employees.manager_id.isna())
    ][["employee_id"]].sort_values(by="employee_id",ascending=True)

   employee_id
5           11